{
    "sections" : {"whoami":"about","Education":"education","Skills":"skills","Achievements":"achievements","Projects":"projects","Contact":"contact"},
    
    "name" : "Sourabh Sheokand",

    "about" : "I am highly motivated Physics postgraduate with a passion for programming and a strong foundation in various languages. 3+ years of experience in Python, adept at core syntax, data structures, algorithms, object-oriented programming (OOP), and libraries. And I learn the programming languages to solve the problem related to Physics and make simulations. Along with that I learn make software to solve the daily life problems and I also learn about other languages like C, C++ and FORTRAN.",

    "education": [
        
        {
            "website" : "https://www.gjust.ac.in",
            "university" : "Guru Jambheshwar University of Science & Technology, Hisar",
            "course" : "M.Sc. Physics",
            "session" : "2022-2024"
        },

        {
            "website" : "https://www.crsu.ac.in",
            "university" : "Chaudary Ranbir Singh University, Jind",
            "course" : "B.Sc. Physics Chemistry Mathematics",
            "session" : "2019-2022"
        }

    ],

    "skills" : [

        {
            "title" : "Programming Languages",
            "content" : {"Python":7, "C":3, "C++":3, "JavaScript":3, "Fortran":6}
        },

        {
            "title" : "Database Management Systems",
            "content" : {"Sqlite3":5,"MySQL":3}
        },

        {
            "title" : "Technologies and Tools",
            "content" : {"HTML":7,"CSS":4,"JSON":6,"Nginx":3,"HTTP":3,"WebSockets":2,"Jinja":7,"LaTeX":7,"Origin":3,"MS Excel":6,"LibPlot2":8,"Arduino":5,"Sensor":6,"TinkerCAD":7}
        },

        {
            "title" : "Operating Systems",
            "content" : {"Ubuntu":6,"Windows":5,"macOs":4}
        },

        {
            "title" : "Frameworks and Libraries",
            "content" : {"Django":4,"Flask":6,"WebSockets":3,"nginx":3,"NumPy":5,"SciPy":5,"MatPlotLib":6,"multiprocessing":4,"threading":5,"Pandas":2,"RESTful API":2}
        },

        {
            "title" : "Version Control and Remote Repository Management System",
            "content" : {"Git":7,"GitHub":5}
        },

        {
            "title" : "Office Suites",
            "content" : {"Microsoft Office":8,"LibreOffice":8}
        },

        {
            "title" : "other",
            "content" : "Good understanding of Physics and Mathematics , and working knowledge of Electronics and Chemistry",
            "highlights" : {"physics":7,"mathematics":5,"electronics":3,"chemistry":3}
        },

        {
            "title" : "other",
            "content" : "Good understanding of computer hardware and networking hardware",
            "highlights" : {"computer":3,"networking":1,"hardware":null}
        }

    ],

    "achievements" : [

        {
            "content" : "Best Explainer in State Level Science Exhibit",
            "highlights" : ["State","Level","Science","Exhibit"]
        },

        {
            "content" : "Intra-University Graduation Mathematics Quiz winner",
            "highlights" : ["Graduation","Mathematics","Quiz","winner"]
        },

        {
            "content" : "Multiple times Science Quiz winner at Inter-College Level and in University",
            "highlights" : ["Science","Quiz","winner"]
        },

        {
            "content" : "Multiple times selected for the State Level Science Exhibit at Graduation level",
            "highlights" : ["State","Level","Science","Exhibit"]
        },

        {
            "content" : "IIT-JAM (2022) qualified",
            "highlights" : ["IIT-JAM","(2022)"]
        }

    ],

    "comment" : "Please give name,desc,link,skills for all projects other are optional",


    "projects" : [


        {
            "content" : {"name":"Name","desc":"Brief Description","link":"Link to Repo","skills":"Skills Used","longdesc":"Long Description","technical":"Technical Description","note":"Note"},
            "name" : "WebRoot",
            "desc" : "It is light weight , easy deployable and a versatile flask app with nginx, that allow easily to share file over the network or internet.",
            "link" : "https://github.com/sourabh945/WebRoot.git",
            "skills" : ["Python","Flask","WebSockets","Nginx","HTML"],
            "longdesc" : "It is a very light weight , easy deployable and a versatile server that can be deployed on any machine with python installed. And then you are ready to share the file of a selected folder to the other client/devices having a web browser, and they can access the content in the folder with there login credentials with encryption and security of the deployed system. The best of this project is that it not need a database for store files it utilize the filesystem for storing the file and accessing the file so it doesn't affect the deployed device and it useable while it share files with other devices and clients. It is written in the Python using Flask framework which is very lightweight and using nginx as the http-server with the using the benefits Multiprocessing for handling multiple concurrent users and also using multi threading to handle the IO jobs. It will allow user to download and upload file from the server/deployed device and it doesn't allow user to delete files for a security of the files and only admin having physical access to computer can delete files. And it stores the all version of the files that being modified to allow admin to finalize the version of the files.",
            "technical" : "It is a flask web app that exposes the selected file system on a machine to local network or to internet for share file with other machine it act like a network drive but it works thought the web browser in the client side and with no file deleting access to clients and storing all version modified files to finalized by admin. It uses nginx as the http-server which run flask app with multiprocessing to handle concurrent clients and it also use multithreading for IO and today filesystem can enable to access the same file to multiple processes without any data corruption. It also using SSL encryption for security. It also user access log for blame. And it use a internal variable server like redis to store the parser key and session key and user data that using the service in present. All the request are send using a parser key which unique to every request and checked on every request and uses to validate user and by decoding it giving a actual request, and it ensure the request is not made by any middle man.",
            "note" : "It take some of the CSS and HTML form the Mozilla Firefox code. So thanks Mozilla.",
            "highlights" : ["flask","server"]
        },

        {
            "content" : {"name":"Name","desc":"Brief Description","link":"Link to Repo","skills":"Skills Used","longdesc":"Long Description","technical":"Technical Description","note":"Note"},
            "name" : "Xanalyzer",
            "desc" : "It is scientific data analysis program written in python use to analyze the X-Ray Diffraction data and finding the crystallite parameter for the sample. And this is step to make free alternative to Origin software.",
            "link" : "https://github.com/sourabh945/xanalyzer.git",
            "skills" : ["Python","SciPy","NumPy","MatPlotLib","Mathematics","Physics","Pandas","shutil"],
            "longdesc" : "It is scientific software used to analyze the X-Ray Diffraction data of the crystals without any/minimum human intervention and finding the crystallite parameter for the sample. It is very useful in Material Science and Nano Science. It made to replace a paid software used by scientists across the world Origin. In my software you just load the file and predefine some parameter and it do all the work. And I also use in master's on my crystal samples. It works only with crystals not with amorphous and I never test with ceramics.",
            "technical" : "It scientific software software to analyze the x-Ray Diffraction data and find the crystallite parameter it written in python and use the SciPy to do all the fitting and NumPy & Panda to manage and manipulate the data. It first finding the all peaks in data and then isolate them and then using a algorithm to find initial value for fitting using SciPy and using Physics finding all the crystallite parameters.",
            "note" : "For advance research please verify the results i don't take any responsibility for any error and inaccuracy in the results."
        }
    ],

    "contacts" : [

        {
            "name" : "Email",
            "source" : "sheokand.sourabh.anil@gmail.com",
            "type" : "email"
        },

        {
            "name" : "GitHub",
            "source" : "https://github.com/sourabh945",
            "type" : "website"
        },

        {
            "name" : "Call",
            "source" : "+91-9306490337",
            "type" : "call"
        },

        {
            "name" : "Whatsapp",
            "source" : "https://wa.me/+919306490337",
            "type" : "message"
        }

    ],

    "experience" : [

        {
            "company" : "Education Zone, Narwana",
            "title" : "Tutor",
            "years" : "2021-2022"
        }

    ]
}